# Dropping entries from an axis with drop()

Droping from a seris

In [1]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
newObj = obj.drop('c')
newObj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

C is removed..we can remove multiple indexes by passing list

In [4]:
newObj.drop(['a','b'])

d    3.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis

In [7]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data.drop(index='Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

To drop from x axis put axis=1

In [14]:
data.drop(columns = 'one',axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

# Indexing, selection, and filtering

For Series

In [16]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [18]:
obj['b']

1.0

In [20]:
obj[['b','c']]

b    1.0
c    2.0
dtype: float64

In [26]:
obj[:2]

a    0.0
b    1.0
dtype: float64

For Dataframe

In [27]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [35]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [36]:
data[2:] # slicing can be done

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data[1] # this gives error

KeyError: 1

In [38]:
data['one']>5

Ohio        False
Colorado    False
Utah         True
New York     True
Name: one, dtype: bool

In [39]:
data[data['one']>5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15